<template>
  <div class="about">
    <section class="comments">
        <h1 class="comments__title">Отзывы</h1>
        <div class="comments__content">
            <InfoCard 
              v-for="(item, index) in pageCheck"
              :key="index" 
              :imageName="item.img"
              :date="item.date"
              :titleName="item.title"
              :txt="item.txt"
            />
            <div class="comments__pages">
              <button class="comments__number" :class="{'active': index === pageNum}" v-for="(item, index) in pages" :key = "index" @click="pageChange(index)">
                  <p>{{index + 1}}</p>
              </button>
            </div>
        </div>
    </section>
  </div>
</template>

<style lang="scss">
.comments {
    width: 90%;
    margin: 0 auto;
    padding: 50px 0;
    &__title {
      text-transform: uppercase;
      font-size: 48px;
    }
    &__text-info {
      padding-right: 20px;
    }
    &__pages {
      display: flex;
      justify-content: center;
    }
    &__number {
      width: 40px;
      height: 30px;
      color: #000;
      font-size: 14px;
      background: none;
      border: 0;
      outline: 0;
      p {
        margin: 0;
      }
      &:hover {
        cursor: pointer;
        p {
          color: #f89513;
        }
      }
      &.active {
        background-color: #000;
        color: #f89513;
        border-radius: 5px;
      }
  }
}
</style>

<script>
import InfoCard from '@/components/InfoCard.vue'
export default {
  name: 'AboutView',
  data() {
    return {
      pageNum: 1,
      pageInfo: 3,
      news: [
        {
          img: 'some.png',
          date: '12.10.2021',
          title: 'Похудение с помощью бодибилдинга',
          txt: 'Вдыхание одного литра кислорода эквивалентно «сжиганию» 5 калорий, однако в минуту при самом высоком темпе движений атлет способен вдохнуть не более 3-4 литров кислорода. Это крайне важно для каждого начинающего атлета.'
        },
        {
          img: 'pallete.png',
          date: '01.02.2022',
          title: 'Заражай друзей, получай призы!',
          txt: 'Дополнительно для Вас: пользование сауной и предоставление средств личной гигиены, пользование баром, таблица замеров, дружеская атмосфера и постоянная поддержка. Мы запотимся о вашем комфорте и предлагаем испытать это уже сегодня!'
        },
        {
          img: 'notebook.png',
          date: '22.12.2021',
          title: 'Фрилансер? Выпрями спину!',
          txt: 'Создайте рабочее место под себя. Вот этот инструмент поможет определить, что подходит именно вам и вашему организму. Используйте специальную подставку для ноутбука, если вы проводите за ним больше 2 часов. Настройте высоту и яркость монитора!'
        },
        {
          img: 'pallete.png',
          date: '12.10.2021',
          title: 'Похудение с помощью бодибилдинга',
          txt: 'Вдыхание одного литра кислорода эквивалентно «сжиганию» 5 калорий, однако в минуту при самом высоком темпе движений атлет способен вдохнуть не более 3-4 литров кислорода. Это крайне важно для каждого начинающего атлета.'
        },
        {
          img: 'notebook.png',
          date: '01.02.2022',
          title: 'Заражай друзей, получай призы!',
          txt: 'Дополнительно для Вас: пользование сауной и предоставление средств личной гигиены, пользование баром, таблица замеров, дружеская атмосфера и постоянная поддержка. Мы запотимся о вашем комфорте и предлагаем испытать это уже сегодня!'
        },
        {
          img: 'some.png',
          date: '22.12.2021',
          title: 'Фрилансер? Выпрями спину!',
          txt: 'Создайте рабочее место под себя. Вот этот инструмент поможет определить, что подходит именно вам и вашему организму. Используйте специальную подставку для ноутбука, если вы проводите за ним больше 2 часов. Настройте высоту и яркость монитора!'
        },
        {
          img: 'notebook.png',
          date: '12.10.2021',
          title: 'Похудение с помощью бодибилдинга',
          txt: 'Вдыхание одного литра кислорода эквивалентно «сжиганию» 5 калорий, однако в минуту при самом высоком темпе движений атлет способен вдохнуть не более 3-4 литров кислорода. Это крайне важно для каждого начинающего атлета.'
        },
        {
          img: 'some.png',
          date: '01.02.2022',
          title: 'Заражай друзей, получай призы!',
          txt: 'Дополнительно для Вас: пользование сауной и предоставление средств личной гигиены, пользование баром, таблица замеров, дружеская атмосфера и постоянная поддержка. Мы запотимся о вашем комфорте и предлагаем испытать это уже сегодня!'
        },
        {
          img: 'pallete.png',
          date: '22.12.2021',
          title: 'Фрилансер? Выпрями спину!',
          txt: 'Создайте рабочее место под себя. Вот этот инструмент поможет определить, что подходит именно вам и вашему организму. Используйте специальную подставку для ноутбука, если вы проводите за ним больше 2 часов. Настройте высоту и яркость монитора!'
        },
      ]
    }
  },
  components: {
    InfoCard
  },
  computed: {
      pages() {
          return Math.ceil(this.news.length / 3)
      },
      pageCheck() {
          let start = this.pageNum * this.pageInfo
          let end = start + this.pageInfo;
          return this.news.slice(start, end)
      }
  },
  methods: {
      pageChange(index) {
        this.pageNum = index
        console.log('ok')
      },
  }
}
</script>